src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Forms/Элемент/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	Иначе
		Если ( Объект.Роли.Количество () = 0 ) Тогда
			заполнитьТЧРоли ();			
		КонецЕсли;
	КонецЕсли;
	ОтобразитьПароль = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	ОтобразитьПароль = НЕ ОтобразитьПароль;
	Элементы.Пароль.РежимПароля = ОтобразитьПароль;
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	заполнитьТЧРоли ();
			
КонецПроцедуры

&НаСервере
Процедура заполнитьТЧРоли ()
	
	Для Каждого роль Из Метаданные.Роли Цикл
		новая = Объект.Роли.Добавить ();
		новая.Роль = роль;
		новая.Использование = Ложь;		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура РолиПередНачаломДобавления ( Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр )
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПередУдалением ( Элемент, Отказ )
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью ( Отказ, ПараметрыЗаписи )
	
	// код ...	
	
КонецПроцедуры
